Revit 2024 API
ViewSchedule.UngroupHeaders Method
 Ungroups selected headers of schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void UngroupHeaders(
	int top,
	int left,
	int bottom,
	int right
)
Visual Basic
Public Sub UngroupHeaders ( _
	top As Integer, _
	left As Integer, _
	bottom As Integer, _
	right As Integer _
)
Visual C++
public:
void UngroupHeaders(
	int top,
	int left,
	int bottom,
	int right
)
Parameters
top
Type: System.Int32
 The index of the top row of the selected headers.
left
Type: System.Int32
 The index of the left column of the selected headers.
bottom
Type: System.Int32
 The index of the bottom row of the selected headers.
right
Type: System.Int32
 The index of the right column of the selected headers.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Headers could not be ungrouped.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace